# Getting Pandas Basic

In [1]:
import pandas as pd
import numpy as np

## Step 1 : Import Dataset

In [2]:
df = pd.read_csv("chipotle.tsv", sep = "\t" )  
# df : data frame
# pd.read_csv() : read file of method pandas
# sep = "\t" vì file .tsv thì dùng tab ngăn cách
#file .csv thì dùng dấu , ngăn cách nên dùng ","
# Mỗi file sẽ có định dạng khác nhau, nên cấu trúc là pd.read_csv("filename", typesep = "?")

In [3]:
df.head(5)
# .head(n) : Use to print n data row first on file

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

## Step 2 : Dataset Overview

In [8]:
# To print number of Row and Column of file
# Result is ( row, col )
df.shape

(4622, 5)

In [9]:
# To print Data type of File ( on each col )
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [18]:
# To print all col name
df.columns
# or Tranform index to list 
list(df.columns)

['order_id', 'quantity', 'item_name', 'choice_description', 'item_price']

In [21]:
# to see RangeIndex of file
df.index

RangeIndex(start=0, stop=4622, step=1)

In [25]:
# to print describe of  file ( just use row have Number )
df.describe()

          order_id     quantity
count  4622.000000  4622.000000
mean    927.254868     1.075725
std     528.890796     0.410186
min       1.000000     1.000000
25%     477.250000     1.000000
50%     926.000000     1.000000
75%    1393.000000     1.000000
max    1834.000000    15.000000

### loc ( label location ) and iloc ( index location )

In [32]:
df.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [40]:
# Use .loc (location) to filter with condition
# Structure :  df.loc[ (df.namecol ==... condition1) |or& ( df.namecol ==... condition2) ]
df.loc[df.quantity >= 10]
df.loc[(df.item_name == "Chicken Bowl") & (df.quantity >= 3)]

,order_id,quantity,item_name,choice_description,item_price
409,178,3,Chicken Bowl,"[[Fresh Tomato Salsa (Mild), Tomatillo-Green C...",$32.94
1514,616,3,Chicken Bowl,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",$26.25

In [44]:
# use .iloc (index location ) to print detail index of row
# Structure df.iloc[n]
df.iloc[9] # type result : Series
df.iloc[[9]] # type result : data frame

,order_id,quantity,item_name,choice_description,item_price
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [69]:
# Structure def.iloc[n:m] 
# return df of row n to m-1
df.iloc[2:5]

,order_id,quantity,item_name,choice_description,item_price
2,1,1,Nantucket Nectar,[Apple],float64
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,float64
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",float64

In [54]:
# in df with both row and column conditions
x= df.iloc[2:5, :-1]
# in X ":-1" mean all col -1col last
y = df.iloc[2:5, -1]
# in y -1 mean get data on col -1 at row 2:5
print(y)

2     $3.39
3     $2.39
4    $16.98
Name: item_price, dtype: object

## Data manipulation : thao tác với dữ liệu

### Apply()

In [57]:
# Có những dữ liệu số ( như tiền ) sẽ ở dạng String, gây ảnh hưởng tới việc thu nhập dữ liệu 
df.item_price.dtype
# dtype('O') là String

dtype('O')

In [71]:
df.item_price = df.item_price.apply(lambda x : float(x.replace('$', '')))
# lambda : hàm dùng để nhận từng giá trị của hàng trên cột được chọn
# .replace(n,m) dùng để thay n thành m
# float() dùng để chuyển String sau khi replace thành float

In [77]:
df.head()
df.item_price.dtype

dtype('float64')

### Tạo cột mới

In [79]:
# Structure : df["new_name_col"] = df["name_col1"] * df["name_col2"]
df["total_price"] = df["quantity"] * df["item_price"]

In [85]:
df.head()

,order_id,quantity,item_name,choice_description,item_price,total_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96

### EX1 : How much was the revenue for the period in the dataset?

### Sum()

In [93]:
# dùng Sum()
x = df["total_price"].sum()
print("x = " ,x)
# hoặc có thể dùng lob
y = df.loc[:, "total_price"].sum()
print("y = ",y)
# hoặc dùng iloc ( không nên vì sau này nếu thêm cột thì vị trí cột -1 sẽ khác ) nên dùng loc ( lable location )
z = df.iloc[:, -1].sum()
print("z = ",z)

x =  39237.02
y =  39237.02
z =  39237.02

### EX2 : What was the most-ordered item?

### Group By()

In [105]:
c = df.groupby("item_name")["quantity"].sum()
c.sort_values(ascending = False).head()
# dùng groupby("name_col") để nhóm các row có cùng tên lại
# ["name_col2"].sum() để hiển thị col cần xét ( ở đây là số lượng )
# sort_values(ascending = False) để sắp xếp giảm dần, mặc định là tăng dần

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Steak Burrito          386
Canned Soft Drink      351
Name: quantity, dtype: int64

### value_counts() tương tự groupby()

In [108]:
df.item_name.value_counts().head()
# Structure : df.name_col.value_counts()
# Value_counts() tự động sắp DESC, không cần sort

item_name
Chicken Bowl           726
Chicken Burrito        553
Chips and Guacamole    479
Steak Burrito          368
Canned Soft Drink      301
Name: count, dtype: int64

In [112]:
# Ngoài ra có thể tính số item_name khác nhau trong file bằng 2 cách
# Cách 1 : value_counts().count()
x = df.item_name.value_counts().count()
print("Số món tính bằng cách 1 : ", x)
# Cách 2 : dùng nunique()
y = df.item_name.nunique()
print("Số món tính bằng cách 2 : ", y)

Số món tính bằng cách 1 :  50
Số món tính bằng cách 2 :  50

### Bài tập mở rộng (tùy chọn)

### Viết một đoạn mã in ra top 5 món ăn được gọi nhiều nhất, sắp xếp giảm dần theo quantity.

In [13]:
df.groupby("item_name")["quantity"].sum().sort_values(ascending=False ).head()

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Steak Burrito          386
Canned Soft Drink      351
Name: quantity, dtype: int64

### In ra số dòng có quantity >= 5 và item_price > 9.

In [14]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [15]:
df["item_price"] = df["item_price"].apply(lambda x : float(x.replace('$', '')))

In [25]:
df.head()
df.loc[(df.quantity >= 5) & (df.item_price > 9)].head()

,order_id,quantity,item_name,choice_description,item_price
3598,1443,15,Chips and Fresh Tomato Salsa,NaN,44.25
3599,1443,7,Bottled Water,NaN,10.50
3887,1559,8,Side of Chips,NaN,13.52
4152,1660,10,Bottled Water,NaN,15.00

### Bài 2 — Tính toán thống kê Với cùng DataFrame df ở trên, hãy: Tạo thêm cột mới tên là total_price = quantity * item_price. Tính giá trị trung bình (mean) của cột total_price. In ra tổng (sum) của toàn bộ total_price.

In [37]:
df["total_price"] = df["quantity"] * df["item_price"]
df.head()

df.total_price.mean()

df.total_price.sum()

np.float64(39237.02)

### Bài 3 — Sắp xếp và chọn dữ liệu Tiếp tục với DataFrame df: Sắp xếp df theo item_price giảm dần. In ra 5 dòng đầu tiên sau khi sắp xếp. Dùng .iloc để in ra hàng cuối cùng và cột cuối cùng của DataFrame.

In [47]:
df.sort_values("item_price", ascending = False).head()

a= df.iloc[ -1:, -1:]
print(a)

,order_id,quantity,item_name,choice_description,item_price,total_price
3598,1443,15,Chips and Fresh Tomato Salsa,NaN,44.25,663.75
3480,1398,3,Carnitas Bowl,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",35.25,105.75
1254,511,4,Chicken Burrito,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",35.00,140.00
3602,1443,4,Chicken Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",35.00,140.00
3601,1443,3,Veggie Burrito,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",33.75,101.25

In [43]:
df.head()

,order_id,quantity,item_name,choice_description,item_price,total_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96